app/channels/channel_channel.rb

  def subscribed
    # stream_from "some_channel"
    #@channel = Channel.find(2) #probably change to a variable that will be passed in body ...
    channel = Channel.find(params[:id])
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]