app/controllers/channels_controller.rb

    def show
        channel = Channel.find(params[:id])
        #change this and any other .first methods to make them dynamic???????
        render json: {channel: channel, message_info: channel.messages.map {|message| {data: message, user: message.user}}}.to_json()
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "channels".* FROM "channels" ORDER BY "channels"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def create
        channel = Channel.new(name: params[:name])

        if channel.save
---
INSERT INTO "channels" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "newChannel"], ["created_at", "2020-11-05 19:56:05.678999"], ["updated_at", "2020-11-05 19:56:05.678999"]]