app/controllers/messages_controller.rb

    def create
        # ActionCable.server.broadcast "channel_channel", body: params[:message]
        message = Message.new(text: params[:message], user_id: User.first().id, channel_id: Channel.find(params[:channel_id]).id)
        # byebug

        if message.save
            # byebug
            channel = Channel.find(params[:channel_id])
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("text", "user_id", "channel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "it's working"], ["user_id", 1], ["channel_id", 1], ["created_at", "2020-11-06 00:35:36.987972"], ["updated_at", "2020-11-06 00:35:36.987972"]]