app/controllers/messages_controller.rb

SELECT "channels".* FROM "channels" ORDER BY "channels"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def create
        # ActionCable.server.broadcast "channel_channel", body: params[:message]
        message = Message.new(text: params[:message], user_id: User.first().id, channel_id: Channel.first().id)
        # byebug

        if message.save
            # byebug
            channel = Channel.first()